vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/RNG_TYPE_A_registers.h
/* Common RNG_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32f427, stm32h503
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "RNG_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t _reserved0    : 2;
		uint32_t RNGEN         : 1; 
		uint32_t IE            : 1; 
		uint32_t _reserved4    : 1;
		uint32_t CED           : 1; 
		uint32_t _reserved6    : 1;
		uint32_t ARDIS         : 1; 
		uint32_t RNG_CONFIG3   : 4; 
		uint32_t NISTC         : 1; 
		uint32_t RNG_CONFIG2   : 3; 
		uint32_t CLKDIV        : 4; 
		uint32_t RNG_CONFIG1   : 6; 
		uint32_t _reserved26   : 4;
		uint32_t CONDRST       : 1; 
		uint32_t CONFIGLOCK    : 1; 
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_rng_type_a,cr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_rng_type_a,cr),bits);

typedef union {
	struct {
		uint32_t DRDY          : 1; 
		uint32_t CECS          : 1; 
		uint32_t SECS          : 1; 
		uint32_t _reserved3    : 2;
		uint32_t CEIS          : 1; 
		uint32_t SEIS          : 1; 
		uint32_t _reserved7    :25;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_rng_type_a,sr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_rng_type_a,sr),bits);

typedef union {
	struct {
		uint32_t DR            :32; // RNG data register,
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_rng_type_a,dr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_rng_type_a,dr),bits);

typedef union {
	struct {
		uint32_t HTCFG         :32; 
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_rng_type_a,htcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_rng_type_a,htcr),bits);

typedef union {
	struct {
		REGDEF_NAME(com_rng_type_a,cr) CR;
		REGDEF_NAME(com_rng_type_a,sr) SR;
		REGDEF_NAME(com_rng_type_a,dr) DR;
		uint32_t _reserved0xC;
		REGDEF_NAME(com_rng_type_a,htcr) HTCR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,rng_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,rng_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,rng_type_a), CR) != 0, "Offset mismatch for CR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,rng_type_a), SR) != 4, "Offset mismatch for SR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,rng_type_a), DR) != 8, "Offset mismatch for DR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,rng_type_a), HTCR) != 16, "Offset mismatch for HTCR");
